<template>
  <el-table
    :data="tableData"
    stripe
    style="width: 100%">
  
    <el-table-column
      prop="name"
      label="项目名称"
      width="180">
    </el-table-column>
    <el-table-column
      prop="address"
      label="项目简介">
    </el-table-column>
    <el-table-column
      prop="jishu"
       width="280"
      label="项目所用技术">
    </el-table-column>
  </el-table>
</template>

<script>
  export default {
    data() {
      return {
        tableData: [{
          name: 'VIP陪练官网',
          address: '这个官网是外包项目，根据对方提出的要求完成相应的需求。里面主要包括移动端和PC端两个方面。里面主要是关于公司介绍，老师的介绍。里面还包括公司用户的注册，还有公司的一些特色。',
          jishu:'html,css,js,vue 全家桶,elementui,'
        }, {
          name: '学校后台管理系统',
          address: '这个项目就是为学校做的一个后台管理，主要是统计学校里面教职工的疗休养情况，评定教职工是否有疗休养资格，学校可以进行发布疗休养情况，添加疗休养时间，线路，还有疗休养名额，发布之后，老师登录自己的账号，就可以看到自己是否有这个资格，如果有资格，就可以报名。此项目主要分为三个角色，超级管理员，系统管理员，普通教职工。他们角色不同，登录所看到的页面也是不同的，这样有助于管理。',
           jishu:'html,css,js,vue 全家桶,elementui,'
        }, {
          name: '健身房后台管理系统',
          address: '健身房后台管理系统是专门为健身房系统制作的后台管理，健身房可以在此系统上添加会员，教练，以及售卡的会籍顾问。健身房管理员可以自己添加。在这个系统里可以看到健身房的销售额以及每一个教练和会籍顾问的销售业绩，和健身房的上课数以及每一个教练的上课数，他们会以图表的的形式反映出来。健身房可以根据自己的情况制定一些活动。系统可以自己添加此健身房的会员卡，以及设置会员卡对应的课程。可以自己制定教练的私教课，以及健身房的团课。这些课程都是以表格形式呈现的。里面还包括这个健身房的上课记录，还有购卡记录。',
          jishu:'html,css,js,vue 全家桶,elementui,'
        }, {
          name: '私教系统',
          address: '私教管理是手机端的配置在微信上的类似于公众号的一个项目。登录之后可以看到这个健身房的详细信息，绑定这个系统的前提就是先在后台管理系统中增加你这个会员。这个系统主要是为了方便健身房会员预约上课。会员可以在这个系统中直接选择时间，选择教练，进行预约。这个系统适合后台管理系统息息相关的',
          jishu:'html,css,js,vue 全家桶,mintui,'
        },
        {
          name: '健身房系统',
          address: '健身系统主要是给健身房使用的一款系统，健身房管理员可以在系统上为会员点击上课，课程会以大屏幕视频的方式为会员上课，会员佩戴手环根据动作自主上课，教练会进行相应的指导。本系统的使用者为超级管理员、管理员、教练和会员，超级管理员账号是系统最高权限，健身房管理员、教练和会员可以由超级管理员，或该健身房管理员增加，会员还可以由管理员教练增加。其中包含了会员根据系统里面的动作进行做锻炼，根据其心率计算其消耗的卡路里，并可以对会员的身体状况进行记录，根据自己的目标对自己提供相应的课程。',
          jishu:'html,css,js,vue 全家桶,elementui,'
        }
        ]
      }
    }
  }
</script>